system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
	(-5 -7 0)
	(10 -7 0)
	(10 7 0)
	(-5 7 0)
	(-5 -7 0.01)
	(10 -7 0.01)
	(10 7 0.01)
	(-5 7 0.01)
);

edges
(
//	arc 0 4 (-7 0 0)
);

blocks 
(
	hex (0 1 2 3 4 5 6 7) (400 200 1) simpleGrading (1 1 1)
);

boundary
(
    topAndBottom
    {
        type wall;
        faces
        (
            (7 3 2 6)
            (4 5 1 0)
        );
    }

    inlet
    {
        type patch;
        faces
        (
            (3 0 4 7)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (6 2 1 5)
        );
    }

    Front 
    {
        type empty;
        faces
        (
            (2 3 0 1)
        );
    }
    Back 
    {
        type empty;
        faces
        (
            (7 6 5 4)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //