system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#includeEtc "caseDicts/mesh/generation/snappyHexMeshDict.cfg"

castellatedMesh true;
snap            true;
addLayers       false;

geometry
{
    CAD
    {
        type triSurfaceMesh;
        file "naca.stl";
    }
    
    refinementBox1
	{
		type searchableCylinder;
		point1 (0 0 0);
		point2 (0 0 0.01);
		radius 2.5;
	}
    refinementBox2
    {
        type searchableCylinder;
        point1 (0 0 0);
        point2 (0 0 0.01);
        radius 1.25;
    }
    AMI
    {
        type triSurfaceMesh;
        file "AMI.stl";
    }
	// AMI
	// {
	// 	type searchableCylinder;
	// 	point1 (0 0 0);
	// 	point2 (0 0 0.01);
	// 	radius 2.5;
	// }
	
	refinementBoxWake
	{
		type searchableBox;
		min (-3.5 -3.5 0);
		max (10 3.5 0.01);
	}
};

castellatedMeshControls
{
    features();

    refinementSurfaces
    {
        CAD
        {
            level (6 6);
            patchInfo { type wall; }
        }
        AMI
		{
			level (5 5);

			patchInfo { type wall; }

			faceZone innerAMI;
			cellZone innerAMI;
			faceType boundary;

			cellZoneInside outside;
		}

    }

    refinementRegions
    {
        CAD
        {
            mode inside;
            levels ((1E15 4));
        }
        refinementBox1
	{
		mode inside;
		levels ((1 2));
	}
        refinementBox2
        {
            mode inside;
            levels ((1 1));
        } 
        refinementBoxWake
        {
            mode inside;
            levels ((0 1));
        }        
    }

    locationInMesh (1e-5 1e-5 1e-5); // Offset from (0 0 0) to avoid
                                     // coinciding with face or edge
    nCellsBetweenLevels 3;
}

snapControls
{
//  explicitFeatureSnap    true;
// implicitFeatureSnap    false;
}

addLayersControls
{
    layers
    {
        "CAD.*"
        {
            nSurfaceLayers 20;
        }
    }

    relativeSizes       false; // false, usually with firstLayerThickness
    expansionRatio      1.2;
//  finalLayerThickness 0.05;
    minThickness        1e-6;
    firstLayerThickness 0.00001881076955220749;

//  maxThicknessToMedialRatio 0.6;
}

writeFlags
(
//    scalarLevels
    layerSets
    layerFields
);

mergeTolerance 1e-6;

// ************************************************************************* //
